{
  "backend/main.mo": "Defines the backend canister's data models for users, testimonies, feed items, Scripture data, and in‑memory maps for storing all app state.",
  "feature_evidence.json": "Lists a feature evidence report describing a spacing adjustment requirement on the AuthGate hero section image and headline.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for many frontend files including pages, components, hooks, and styles.",
  "frontend/index.css": "Defines global Tailwind base styles and custom CSS variables for light/dark themes and design tokens.",
  "frontend/index.html": "HTML entry point setting favicon links and mounting the React root with main.tsx.",
  "frontend/src/App.tsx": "Configures the root React router, authentication flow, layout wrapper, and all major evangelism and feed routes.",
  "frontend/src/components/AuthGate.tsx": "Landing page with hero image, tightened image–headline spacing, subheadline, and CTA buttons for login and faith resources.",
  "frontend/src/components/bible/BibleReader.tsx": "Empty placeholder file for a future Bible reader component.",
  "frontend/src/components/bible/BibleSidebar.tsx": "Empty placeholder file for a future Bible sidebar component.",
  "frontend/src/components/bible/BibleSidebarContext.tsx": "Empty placeholder file for Bible sidebar context logic.",
  "frontend/src/components/bible/ReferenceSearch.tsx": "Empty placeholder file for a future Scripture reference search component.",
  "frontend/src/components/evangelism/EvangelismCtaCard.tsx": "CTA card guiding users to sign in, complete onboarding, or continue to the feed based on authentication state.",
  "frontend/src/components/evangelism/EvangelismPageShell.tsx": "Layout wrapper for evangelism pages with optional hero image, title section, and content styling.",
  "frontend/src/components/feed/AddCommentForm.tsx": "Form for submitting comments or prayer requests with optional scripture references and async submission handling.",
  "frontend/src/components/feed/AgentReplyCard.tsx": "Displays an AI agent's reply with content, scripture references, and timestamp in a styled card.",
  "frontend/src/components/feed/AuthorIdentityBadge.tsx": "Shows author identity, distinguishing system agent posts from regular user profiles.",
  "frontend/src/components/feed/CommentsThreadDialog.tsx": "Modal dialog showing a scrollable list of comments and an input form for adding new comments.",
  "frontend/src/components/feed/CreatePostComposer.tsx": "Composer card for creating new feed posts with content and optional scripture references.",
  "frontend/src/components/feed/FeedItemCard.tsx": "Renders different feed item types (scripture, discernment, testimony) with navigation to detail views.",
  "frontend/src/components/feed/FollowButton.tsx": "Follow/unfollow button with async mutation handling and disabled states for system or self profiles.",
  "frontend/src/components/feed/ReactionBar.tsx": "Like/reaction control that toggles user reaction state and displays the reaction count.",
  "frontend/src/components/feed/RepostButton.tsx": "Button for reposting a feed item with async mutation and repost count display.",
  "frontend/src/components/feed/UnifiedFeedItemCard.tsx": "Displays a feed item card with metadata, author info, repost indicators, and action buttons.",
  "frontend/src/components/layout/AppHeader.tsx": "Renders the main site header with navigation, identity actions, and support button.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the global page structure including header, main content area, and footer.",
  "frontend/src/components/layout/SupportWithIcpButton.tsx": "Shows a button opening a dialog for copying an ICP support address.",
  "frontend/src/constants/brand.ts": "Defines brand asset paths and the brand name constant.",
  "frontend/src/hooks/queryKeys.ts": "Centralizes React Query cache keys for data fetching.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useBibleLastLocation.ts": "Fetches and saves the user’s last Bible reading location using the backend actor.",
  "frontend/src/hooks/useBibleQueries.ts": "Provides hooks to query translations, books, chapters, verses, and perform verse search.",
  "frontend/src/hooks/useEvangelismScrollToTop.ts": "Scrolls to the top on navigation to specific evangelism-related routes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity loading.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks wrapping actor calls for user profiles, feeds, posts, reactions, and comments with cache invalidation.",
  "frontend/src/index.css": "Tailwind base and utility layers defining theme variables, dark mode, typography, and custom UI utilities.",
  "frontend/src/main.tsx": "Sets up the React app root with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AssuranceNextStepsPage.tsx": "Evangelism page rendering next‑steps content with cards, scripture badges, navigation links, and a CTA component.",
  "frontend/src/pages/ConnectPage.tsx": "Evangelism page displaying community‑focused sections, scripture references, navigation links, and a CTA component.",
  "frontend/src/pages/DailyFeedPage.tsx": "Loads unified and legacy feed data, shows post composer for authenticated users, and renders tabbed social and daily feeds.",
  "frontend/src/pages/DiscernmentDetailPage.tsx": "Displays a single discernment reflection with scripture references, labels, and navigation back to the feed.",
  "frontend/src/pages/evangelism/topics-questions/TopicPageShell.tsx": "Generic shell for rendering a single topic page with sections, references, back navigation, and CTA.",
  "frontend/src/pages/evangelism/topics-questions/topics/HowToReadTheBiblePage.tsx": "Loads the 'how to read the Bible' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/HowToShareYourFaithPage.tsx": "Loads the 'how to share your faith' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatHappensAfterDeathPage.tsx": "Loads the 'what happens after death' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsBaptismPage.tsx": "Loads the 'what is baptism' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsFaithPage.tsx": "Loads the 'what is faith' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsPrayerPage.tsx": "Loads the 'what is prayer' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsRepentancePage.tsx": "Loads the 'what is repentance' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsSalvationPage.tsx": "Loads the 'what is salvation' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsSinPage.tsx": "Loads the 'what is sin' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsTheChurchPage.tsx": "Loads the 'what is the church' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsTheGospelPage.tsx": "Loads the 'what is the gospel' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhoIsGodPage.tsx": "Loads the 'who is God' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhyDidJesusDiePage.tsx": "Loads the 'why did Jesus die' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelismContent.ts": "Defines structured gospel and Christ-centered teaching content, including sections, references, and a Church Origins framing.",
  "frontend/src/pages/FaithResourcesPage.tsx": "Displays a page of introductory and growth-oriented faith resources with categorized cards and navigation links.",
  "frontend/src/pages/HowToBeginPage.tsx": "Presents step-by-step guidance for beginning a relationship with God using dynamic content and scripture references.",
  "frontend/src/pages/NotFoundPage.tsx": "Provides a 404 error page with options to go home or navigate back.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects user profile details and saves them before navigating to the personalized feed.",
  "frontend/src/pages/PeaceWithGodPage.tsx": "Explains the Gospel message through structured sections with references and links to related topics.",
  "frontend/src/pages/peaceWithGodStepsContent.ts": "Provides step-by-step evangelism content with outlines, detailed text, and associated Scripture for the Peace With God pages.",
  "frontend/src/pages/PeaceWithGodStepsIntroPage.tsx": "Introduces a four-step journey toward peace with God and provides an entry point to the full steps flow.",
  "frontend/src/pages/PeaceWithGodStepsLongPage.tsx": "Renders a long-form evangelism page showing multi-step gospel content, scriptures, and guidance on receiving Christ.",
  "frontend/src/pages/ScriptureDetailPage.tsx": "Displays a single scripture entry from the daily feed with text, reflection, and labels, including loading and error states.",
  "frontend/src/pages/SubmitTestimonyPage.tsx": "Provides a form to submit a testimony with scripture references and shows a confirmation screen after submission.",
  "frontend/src/pages/topicsQuestionsContent.ts": "Contains topic-based theological content with sections, references, and Church Origins framing for common faith questions.",
  "frontend/src/pages/TopicsQuestionsIndexPage.tsx": "Lists all topics/questions with links to detail pages using cards within an evangelism page layout.",
  "frontend/src/pages/WhyJesusPage.tsx": "Shows an evangelistic explanation of who Jesus is using structured sections, references, and navigation links.",
  "frontend/src/utils/bibleReference.ts": "Implements parsing and validation utilities for Bible references, including compact reference matching and normalization.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL and session-based parameters for routing and state.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, typography, container settings, and plugin setup.",
  "project_state.json": "Defines the current project state, including metadata, an existing spacing-adjustment feature, and a new request to remove extra spacing. Tracks project versions, issues, and configuration flags."
}