{
  "backend/main.mo": "Defines data types and in-memory maps for user profiles, testimonies, scripture content, reflections, feed items, comments, and authorization-protected CRUD operations.",
  "feature_evidence.json": "Contains feature evidence records mapping feature IDs to components, related files, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Provides high-level descriptions of major frontend components, pages, hooks, and styles used across the application.",
  "frontend/index.css": "Tailwind base and theme variable definitions setting the app’s color system, dark mode values, and global background/foreground styling.",
  "frontend/index.html": "HTML entry point defining metadata, favicon assets, and the root mounting element for the React application.",
  "frontend/src/App.tsx": "Configures routing, query client, layouts, and imports all application pages including evangelism flows and feed-related screens.",
  "frontend/src/components/AuthGate.tsx": "Landing/authentication page with a hero image, headline, feature highlights, and login/faith-resources CTAs.",
  "frontend/src/components/evangelism/EvangelismCtaCard.tsx": "Auth-aware CTA card that drives users to sign in, complete onboarding, or navigate to the feed.",
  "frontend/src/components/evangelism/EvangelismPageShell.tsx": "Page shell with optional hero image, title, subtitle, and standardized evangelism content layout.",
  "frontend/src/components/feed/AddCommentForm.tsx": "Form for adding comments or prayer requests with reference parsing and submission handling.",
  "frontend/src/components/feed/AgentReplyCard.tsx": "Displays an AI agent’s reply with references and timestamp styling.",
  "frontend/src/components/feed/AuthorIdentityBadge.tsx": "Shows author identity, distinguishing between system agent posts and regular user profiles.",
  "frontend/src/components/feed/CommentsThreadDialog.tsx": "Dialog showing a scrollable thread of comments and an embedded form to add new ones.",
  "frontend/src/components/feed/CreatePostComposer.tsx": "Composer for creating new feed posts with optional scripture references.",
  "frontend/src/components/feed/FeedItemCard.tsx": "Card renderer for scripture, discernment, or testimony feed items with navigation to detail views.",
  "frontend/src/components/feed/FollowButton.tsx": "Follow/unfollow button with async mutation handling and identity checks.",
  "frontend/src/components/feed/ReactionBar.tsx": "Reaction control allowing users to like/unlike items with mutation handling.",
  "frontend/src/components/feed/RepostButton.tsx": "Button to repost an item to the user’s feed with loading state and toast feedback.",
  "frontend/src/components/feed/UnifiedFeedItemCard.tsx": "Renders a feed item card with icons, author info, repost detection, timestamps, and follow/reaction/comment controls.",
  "frontend/src/components/layout/AppHeader.tsx": "Implements the top navigation bar with evangelism links, resource links, and authentication actions.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the global page layout including header, main content container, and footer.",
  "frontend/src/constants/brand.ts": "Defines paths for logo and favicon assets along with the brand name.",
  "frontend/src/hooks/queryKeys.ts": "Centralizes React Query cache keys for user profiles, feeds, reactions, and follow data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity, invalidating queries when identity changes.",
  "frontend/src/hooks/useEvangelismScrollToTop.ts": "Scrolls to top automatically on evangelism-related routes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls with React Query hooks for profiles, feeds, posts, reactions, and comments.",
  "frontend/src/index.css": "Defines Tailwind CSS base styles, color variables, typography, and utility classes for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AssuranceNextStepsPage.tsx": "Renders assurance and next‑steps discipleship content using evangelism data, with scripture badges and navigation links.",
  "frontend/src/pages/ConnectPage.tsx": "Displays community‑focused spiritual growth sections with scripture references and links to related evangelism pages.",
  "frontend/src/pages/DailyFeedPage.tsx": "Fetches unified and legacy feed data, interleaves daily content, and renders social and daily feed tabs with posting support.",
  "frontend/src/pages/DiscernmentDetailPage.tsx": "Loads a specific discernment reflection by index and displays its content, labels, and scripture references with navigation back to the feed.",
  "frontend/src/pages/evangelism/topics-questions/TopicPageShell.tsx": "Generic layout component for individual topic pages, rendering sections, references, a back link, framing content, and a CTA.",
  "frontend/src/pages/evangelism/topics-questions/topics/HowToReadTheBiblePage.tsx": "Loads the 'how-to-read-the-bible' topic and renders it using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/HowToShareYourFaithPage.tsx": "Loads the 'how-to-share-your-faith' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatHappensAfterDeathPage.tsx": "Loads the 'what-happens-after-death' topic and passes it to TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsBaptismPage.tsx": "Displays the 'what-is-baptism' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsFaithPage.tsx": "Displays the 'what-is-faith' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsPrayerPage.tsx": "Displays the 'what-is-prayer' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsRepentancePage.tsx": "Displays the 'what-is-repentance' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsSalvationPage.tsx": "Displays the 'what-is-salvation' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsSinPage.tsx": "Displays the 'what-is-sin' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsTheChurchPage.tsx": "Displays the 'what-is-the-church' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsTheGospelPage.tsx": "Displays the 'what-is-the-gospel' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhoIsGodPage.tsx": "Displays the 'who-is-god' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhyDidJesusDiePage.tsx": "Displays the 'why-did-jesus-die' topic using TopicPageShell.",
  "frontend/src/pages/evangelismContent.ts": "Defines structured evangelism content including sections, scripture references, and church-origins framing for pages like Peace With God and Why Jesus.",
  "frontend/src/pages/FaithResourcesPage.tsx": "Presents categorized links to foundational and growth‑oriented faith resources using styled cards and icons.",
  "frontend/src/pages/HowToBeginPage.tsx": "Shows step‑by‑step guidance for beginning faith in Christ, including scripture‑backed steps, a sample prayer, and related navigation links.",
  "frontend/src/pages/OnboardingPage.tsx": "Renders an onboarding form collecting name, life situation, and spiritual needs, then saves the profile and navigates to the feed.",
  "frontend/src/pages/PeaceWithGodPage.tsx": "Displays gospel-focused teaching sections with references, related topic links, and evangelism content in a structured layout.",
  "frontend/src/pages/peaceWithGodStepsContent.ts": "Provides content and scripture references for the 'Steps to Peace with God' framework including step outlines and detailed step data.",
  "frontend/src/pages/PeaceWithGodStepsIntroPage.tsx": "Introduces a four-step gospel journey with step summaries and a CTA to start the full guide.",
  "frontend/src/pages/PeaceWithGodStepsLongPage.tsx": "Shows the full detailed four-step gospel explanation with scripture, response steps, and a prayer.",
  "frontend/src/pages/ScriptureDetailPage.tsx": "Shows a detailed view of a selected scripture from the daily feed, including text, reflection, and labels.",
  "frontend/src/pages/SubmitTestimonyPage.tsx": "Provides a form to submit a testimony with scripture references and shows a confirmation screen after submission.",
  "frontend/src/pages/topicsQuestionsContent.ts": "Defines the TopicContent interface and provides structured theological content for topics and questions used in the frontend.",
  "frontend/src/pages/TopicsQuestionsIndexPage.tsx": "Renders the index of topics and questions with links generated from slugs and styled cards inside an evangelism page layout.",
  "frontend/src/pages/WhyJesusPage.tsx": "Displays the 'Why Jesus?' evangelism content with section cards, scripture badges, navigation links, and a CTA within an evangelism page shell.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session parameters, including support for hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins like typography and container queries.",
  "project_state.json": "Project metadata describing current features, image requirements, requested additions, and overall project state."
}