{
  "backend/main.mo": "Defines types for user profiles, testimonies, scripture content, feed items, comments, Bible data, and initializes in‑memory maps for all backend state.",
  "feature_evidence.json": "Lists feature evidence records referencing changes to AuthGate, including hero‑image removal and related code cleanup.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files including pages, components, hooks, and configuration.",
  "frontend/index.css": "Tailwind base theme defining color variables, dark mode values, and global styles for background, text, and borders.",
  "frontend/index.html": "HTML entry point setting icons, metadata, root mount node, and loading the main application script.",
  "frontend/src/App.tsx": "Sets up router, theme, query client, layouts, and all evangelism and feed routes for the application.",
  "frontend/src/components/AuthGate.tsx": "Landing page with headline, subheadline, login CTA, faith‑resources link, and a three‑feature overview section.",
  "frontend/src/components/bible/BibleReader.tsx": "Empty placeholder file for future Bible reader component.",
  "frontend/src/components/bible/BibleSidebar.tsx": "Empty placeholder file for future Bible sidebar component.",
  "frontend/src/components/bible/BibleSidebarContext.tsx": "Empty placeholder file for Bible sidebar context provider.",
  "frontend/src/components/bible/ReferenceSearch.tsx": "Empty placeholder file for a Scripture reference search component.",
  "frontend/src/components/evangelism/EvangelismCtaCard.tsx": "CTA card prompting sign‑in or navigation to onboarding or feed based on authentication and profile state.",
  "frontend/src/components/evangelism/EvangelismPageShell.tsx": "Layout shell for evangelism pages with optional hero image, title, subtitle, and content container.",
  "frontend/src/components/feed/AddCommentForm.tsx": "Form for submitting comments or prayer requests with optional scripture references and async submission handling.",
  "frontend/src/components/feed/AgentReplyCard.tsx": "Displays an AI agent's reply with content, references, verification badge, and timestamp.",
  "frontend/src/components/feed/AuthorIdentityBadge.tsx": "Shows either a system agent badge or a community member name based on the author's principal.",
  "frontend/src/components/feed/CommentsThreadDialog.tsx": "Dialog showing a scrollable thread of comments plus a form to add new comments.",
  "frontend/src/components/feed/CreatePostComposer.tsx": "Card-based composer for creating new posts with content and optional scripture references.",
  "frontend/src/components/feed/FeedItemCard.tsx": "Renders feed items for scripture, discernment reflections, or testimonies with navigation handling.",
  "frontend/src/components/feed/FollowButton.tsx": "Button to follow or unfollow a user with loading states and identity checks.",
  "frontend/src/components/feed/ReactionBar.tsx": "Provides a like button with count and toggling between add and remove reaction states.",
  "frontend/src/components/feed/RepostButton.tsx": "Button to repost an item to the user’s feed with loading and success feedback.",
  "frontend/src/components/feed/UnifiedFeedItemCard.tsx": "Renders a unified feed card showing post type, author, date, and actions like follow, reactions, and reposting.",
  "frontend/src/components/layout/AppHeader.tsx": "Implements the top navigation bar with evangelism links, resource links, support button, and authentication actions.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps pages with the app header, main content container, and footer including a branded link.",
  "frontend/src/components/layout/SupportWithIcpButton.tsx": "Provides a dialog button for copying an ICP address to support the project financially.",
  "frontend/src/constants/brand.ts": "Exports brand asset paths and the application’s brand name.",
  "frontend/src/hooks/queryKeys.ts": "Defines centralized React Query cache keys for user, feed, and Bible data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useBibleLastLocation.ts": "Fetches and saves the user’s last-read Bible location using the backend actor.",
  "frontend/src/hooks/useBibleQueries.ts": "Provides hooks to fetch Bible translations, books, chapters, verses, and search results via the backend actor.",
  "frontend/src/hooks/useEvangelismScrollToTop.ts": "Scrolls to the top when navigating to designated evangelism-related routes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity login state, initializes AuthClient, and exposes identity, login, and logout functions.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, feed data, posts, reactions, and comments via the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers, color variables, typography, and utility classes for the app’s dark-themed UI.",
  "frontend/src/main.tsx": "Bootstraps the React app, initializing React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AssuranceNextStepsPage.tsx": "Renders the Assurance & Next Steps evangelism page with structured sections, scripture badges, navigation links, and a CTA card.",
  "frontend/src/pages/ConnectPage.tsx": "Displays the Connect evangelism page with teaching sections, scripture references, navigation links, and a CTA card.",
  "frontend/src/pages/DailyFeedPage.tsx": "Shows the community feed with post creation, unified social feed, and interleaved daily scripture, reflections, and testimonies.",
  "frontend/src/pages/DiscernmentDetailPage.tsx": "Displays details for a selected discernment reflection, including content, scripture references, labels, and navigation back to the feed.",
  "frontend/src/pages/evangelism/topics-questions/TopicPageShell.tsx": "Generic layout wrapper for individual topic pages rendering sections, references, and a CTA card.",
  "frontend/src/pages/evangelism/topics-questions/topics/HowToReadTheBiblePage.tsx": "Loads and renders the 'how to read the Bible' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/HowToShareYourFaithPage.tsx": "Loads and renders the 'how to share your faith' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatHappensAfterDeathPage.tsx": "Loads and renders the 'what happens after death' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsBaptismPage.tsx": "Loads and renders the 'what is baptism' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsFaithPage.tsx": "Loads and renders the 'what is faith' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsPrayerPage.tsx": "Loads and renders the 'what is prayer' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsRepentancePage.tsx": "Loads and renders the 'what is repentance' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsSalvationPage.tsx": "Loads and renders the 'what is salvation' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsSinPage.tsx": "Loads and renders the 'what is sin' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsTheChurchPage.tsx": "Loads and renders the 'what is the church' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsTheGospelPage.tsx": "Loads and renders the 'what is the gospel' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhoIsGodPage.tsx": "Loads and renders the 'who is God' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhyDidJesusDiePage.tsx": "Loads and renders the 'why did Jesus die' topic using TopicPageShell.",
  "frontend/src/pages/evangelismContent.ts": "Defines structured evangelism content with topics, sections, and Scripture references for Gospel teaching pages.",
  "frontend/src/pages/FaithResourcesPage.tsx": "Renders a resource hub with categorized faith content and navigation links for beginners and growing believers.",
  "frontend/src/pages/HowToBeginPage.tsx": "Displays step‑by‑step guidance for beginning a relationship with Jesus, using structured content, references, and navigation.",
  "frontend/src/pages/NotFoundPage.tsx": "Shows a 404 error page with options to return home or go back.",
  "frontend/src/pages/OnboardingPage.tsx": "Provides a form to collect user profile details and saves them before navigating to the feed.",
  "frontend/src/pages/PeaceWithGodPage.tsx": "Presents Gospel-focused sections with references, follow‑up topics, and links to related evangelism pages.",
  "frontend/src/pages/peaceWithGodStepsContent.ts": "Provides step-by-step Gospel presentation content and supporting interfaces, including outlines, detailed text, and Scripture passages.",
  "frontend/src/pages/PeaceWithGodStepsIntroPage.tsx": "Introduces a four‑step journey toward peace with God and links to the full steps page with supportive context.",
  "frontend/src/pages/PeaceWithGodStepsLongPage.tsx": "Renders a long multi-step evangelism page with step content, scriptures, response steps, and a prayer section.",
  "frontend/src/pages/ScriptureDetailPage.tsx": "Displays a detailed view of a single scripture from the daily feed with text, reflection, and labels.",
  "frontend/src/pages/SubmitTestimonyPage.tsx": "Provides a form to submit a testimony with scripture references and shows a confirmation view after submission.",
  "frontend/src/pages/topicsQuestionsContent.ts": "Contains question-based theological topic content with sections, references, and a Church Origins framing.",
  "frontend/src/pages/TopicsQuestionsIndexPage.tsx": "Lists all Topics & Questions articles with links, descriptions, and a call-to-action card.",
  "frontend/src/pages/WhyJesusPage.tsx": "Shows an evangelism page explaining why Jesus matters, with sections, scripture references, and navigation links.",
  "frontend/src/utils/bibleReference.ts": "Implements utilities for validating and parsing Bible references, including book and chapter lookup.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read, persist, and clear URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theming, colors, typography, animations, and plugins.",
  "project_state.json": "Stores high-level project metadata, feature states, and request tracking for the hero image removal project."
}