{
  "backend/main.mo": "Defines core actor types and state for user profiles, testimonies, scripture entries, reflections, feed items, and access-controlled CRUD operations.",
  "feature_evidence.json": "Contains feature evidence metadata for hero‑image asset validation and update requirements with associated components and tests.",
  "frontend-file-summaries.txt": "Provides high‑level summaries of major frontend files including components, pages, hooks, and configuration.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color variables, dark mode overrides, and global background/foreground styling.",
  "frontend/index.html": "HTML entry point setting favicon assets, metadata, and the root mount for the React app.",
  "frontend/src/App.tsx": "Sets up TanStack router, query client, layout, and routes for onboarding, feed, testimony, scripture, reflections, evangelism pages, and faith resources.",
  "frontend/src/components/AuthGate.tsx": "Landing/authentication gate with hero image, login CTA, fallback placeholder, and feature highlights.",
  "frontend/src/components/evangelism/EvangelismCtaCard.tsx": "CTA card guiding users to sign in, complete onboarding, or navigate to the feed based on authentication state.",
  "frontend/src/components/evangelism/EvangelismPageShell.tsx": "Layout wrapper for evangelism pages with optional hero image, title, subtitle, and content styling.",
  "frontend/src/components/feed/AddCommentForm.tsx": "Form for submitting comments or prayer requests, handling references, validation, and API submission.",
  "frontend/src/components/feed/AgentReplyCard.tsx": "Displays an AI agent’s reply with content, scripture references, and timestamp.",
  "frontend/src/components/feed/AuthorIdentityBadge.tsx": "Shows the author’s identity or a system agent badge based on the principal.",
  "frontend/src/components/feed/CommentsThreadDialog.tsx": "Dialog showing a scrollable comments thread with support for agent replies and adding new comments.",
  "frontend/src/components/feed/CreatePostComposer.tsx": "Composer card for creating new posts with optional references and submission handling.",
  "frontend/src/components/feed/FeedItemCard.tsx": "Renders a feed item card for scripture, discernment, or testimony entries with navigation.",
  "frontend/src/components/feed/FollowButton.tsx": "Follow/unfollow button with state handling, disabled for self or system agent.",
  "frontend/src/components/feed/ReactionBar.tsx": "Like/reaction control allowing users to add or remove a heart reaction.",
  "frontend/src/components/feed/RepostButton.tsx": "Button to repost an item to the user’s feed with loading and success handling.",
  "frontend/src/components/feed/UnifiedFeedItemCard.tsx": "Renders a feed item card with icons, author info, timestamps, and actions like follow, reactions, and comments.",
  "frontend/src/components/layout/AppHeader.tsx": "Provides the main header with navigation buttons, evangelism links, and authentication actions.",
  "frontend/src/components/layout/AppLayout.tsx": "Wraps the app with a header, main content container, and footer layout.",
  "frontend/src/constants/brand.ts": "Defines paths for logo and brand assets along with the brand name constant.",
  "frontend/src/hooks/queryKeys.ts": "Centralizes React Query cache keys for user profiles, feeds, reactions, and follow states.",
  "frontend/src/hooks/useActor.ts": "Initializes and manages the backend actor, refreshing queries when identity changes.",
  "frontend/src/hooks/useEvangelismScrollToTop.ts": "Scrolls to top on specific evangelism-related routes using router path detection.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication state, login, and logout logic using Internet Identity.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend calls in React Query hooks for profiles, posts, feeds, reactions, and comments.",
  "frontend/src/index.css": "Defines global Tailwind styles, theme variables, typography, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/AssuranceNextStepsPage.tsx": "Renders the Assurance & Next Steps page using evangelism content, showing growth steps, scripture badges, navigation links, and a CTA card.",
  "frontend/src/pages/ConnectPage.tsx": "Displays the Connect page with community-oriented faith sections, scripture references, navigation links, and a CTA card.",
  "frontend/src/pages/DailyFeedPage.tsx": "Fetches and displays unified social posts and interleaved legacy feed items with loading, error handling, tabs, and optional post creation.",
  "frontend/src/pages/DiscernmentDetailPage.tsx": "Shows details for a single discernment reflection, including scripture references, labels, and navigation back to the feed.",
  "frontend/src/pages/evangelism/topics-questions/TopicPageShell.tsx": "Generic shell component for individual topic pages, rendering sections, references, a back link, and a CTA card.",
  "frontend/src/pages/evangelism/topics-questions/topics/HowToReadTheBiblePage.tsx": "Loads the 'how-to-read-the-bible' topic and renders it through TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/HowToShareYourFaithPage.tsx": "Loads the 'how-to-share-your-faith' topic and renders it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatHappensAfterDeathPage.tsx": "Loads the 'what-happens-after-death' topic and renders it through TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsBaptismPage.tsx": "Loads the 'what-is-baptism' topic and displays it using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsFaithPage.tsx": "Loads the 'what-is-faith' topic and renders it through TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsPrayerPage.tsx": "Loads the 'what-is-prayer' topic and displays it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsRepentancePage.tsx": "Loads the 'what-is-repentance' topic and renders it through TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsSalvationPage.tsx": "Loads the 'what-is-salvation' topic and displays it using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsSinPage.tsx": "Loads the 'what-is-sin' topic and renders it through TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsTheChurchPage.tsx": "Loads the 'what-is-the-church' topic and displays it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsTheGospelPage.tsx": "Loads the 'what-is-the-gospel' topic and renders it through TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhoIsGodPage.tsx": "Loads the 'who-is-god' topic and displays it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhyDidJesusDiePage.tsx": "Loads the 'why-did-jesus-die' topic and renders it through TopicPageShell.",
  "frontend/src/pages/evangelismContent.ts": "Defines structured evangelism content for pages like Peace With God and Why Jesus, including sections, references, and framing text.",
  "frontend/src/pages/FaithResourcesPage.tsx": "Provides categorized links to foundational and growth-oriented faith resources using cards and icon headers.",
  "frontend/src/pages/HowToBeginPage.tsx": "Presents step-by-step guidance for beginning faith in Christ with scripture badges, a sample prayer, next-step links, and a CTA card.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects user profile details (name, life situation, spiritual needs) and saves them before navigating to the feed.",
  "frontend/src/pages/PeaceWithGodPage.tsx": "Displays gospel-focused content with sections, scripture references, and links to related evangelism topics.",
  "frontend/src/pages/peaceWithGodStepsContent.ts": "Provides step-by-step evangelism content and scripture references for the Peace With God framework.",
  "frontend/src/pages/PeaceWithGodStepsIntroPage.tsx": "Introduces a four-step journey to peace with God and links to the full steps page, with brief summaries of each step.",
  "frontend/src/pages/PeaceWithGodStepsLongPage.tsx": "Provides the full multi-step gospel explanation with detailed text, scriptures, response steps, and a sample prayer.",
  "frontend/src/pages/ScriptureDetailPage.tsx": "Shows a detailed view of a selected scripture from the daily feed, including text, reflection, and labels.",
  "frontend/src/pages/SubmitTestimonyPage.tsx": "Allows users to submit testimonies with optional scripture references and displays a confirmation after submission.",
  "frontend/src/pages/topicsQuestionsContent.ts": "Defines the TopicContent interface and provides an array of structured theological Q&A content used for topic-based pages.",
  "frontend/src/pages/TopicsQuestionsIndexPage.tsx": "Renders the Topics & Questions index page, mapping topic slugs to routes and listing topic cards with titles and descriptions.",
  "frontend/src/pages/WhyJesusPage.tsx": "Displays the 'Why Jesus?' evangelism page using structured content, scripture references, navigation links, and a CTA card.",
  "frontend/src/utils/urlParams.ts": "Provides helper functions to read, store, retrieve, and clear URL and sessionStorage parameters, including persistence logic.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS theme extensions, colors, fonts, animations, and plugins for the frontend build.",
  "project_state.json": "Stores project metadata, feature states, and requirements regarding updating and managing the landing-page hero image."
}