{
  "backend/main.mo": "Defines user profiles, testimonies, scripture entries, feed items, comments, and agent responses with authorization checks and storage maps.",
  "feature_evidence.json": "Feature evidence file describing scroll‑to‑top behavior for evangelism routes and listing related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files including pages, components, hooks, and styles.",
  "frontend/index.css": "Tailwind base/style configuration defining light and dark theme color tokens and global styles.",
  "frontend/index.html": "HTML entry point that sets metadata, loads the icon, and mounts the React app.",
  "frontend/src/App.tsx": "Main app router and layout setup integrating evangelism scroll‑to‑top behavior and authenticated routing logic.",
  "frontend/src/components/AuthGate.tsx": "Sign‑in gate prompting users to authenticate or explore faith resources, handling Internet Identity login state.",
  "frontend/src/components/evangelism/EvangelismCtaCard.tsx": "CTA card guiding users toward sign‑in, onboarding, or feed based on identity and profile state.",
  "frontend/src/components/evangelism/EvangelismPageShell.tsx": "Shared evangelism page layout with optional hero image, title section, and content wrapper.",
  "frontend/src/components/feed/AddCommentForm.tsx": "Form for adding comments or prayer requests with optional scripture references and mutation handling.",
  "frontend/src/components/feed/AgentReplyCard.tsx": "Card UI displaying an AI agent’s reply with content, references, and timestamp.",
  "frontend/src/components/feed/AuthorIdentityBadge.tsx": "Displays author identity, showing a system badge for agent posts or the user’s profile name.",
  "frontend/src/components/feed/CommentsThreadDialog.tsx": "Dialog showing a scrollable list of comments plus a form to add new comments.",
  "frontend/src/components/feed/CreatePostComposer.tsx": "Composer card for creating a new user post with optional scripture references.",
  "frontend/src/components/feed/FeedItemCard.tsx": "Renders scripture, discernment, or testimony items with navigation to detailed views.",
  "frontend/src/components/feed/FollowButton.tsx": "Button to follow or unfollow a user with mutation state handling and identity checks.",
  "frontend/src/components/feed/ReactionBar.tsx": "Reaction control allowing users to like or unlike an item and showing count.",
  "frontend/src/components/feed/RepostButton.tsx": "Button to repost an item to the user's feed with loading and success feedback.",
  "frontend/src/components/feed/UnifiedFeedItemCard.tsx": "Unified feed card rendering various item types, author info, actions, and repost indicators.",
  "frontend/src/components/layout/AppHeader.tsx": "Header component with navigation, auth-aware buttons, and logout handling.",
  "frontend/src/components/layout/AppLayout.tsx": "Page layout wrapper with background, header, main content area, and footer.",
  "frontend/src/hooks/queryKeys.ts": "Centralized React Query key definitions for all data-fetching operations.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useEvangelismScrollToTop.ts": "Scrolls to top when navigating to specific evangelism-related routes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, login/clear functions, and identity initialization logic.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching and mutating user profiles, feeds, posts, reactions, and comments via the backend actor.",
  "frontend/src/index.css": "Tailwind base setup with custom color variables, dark mode values, typography, and utility classes.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/pages/AssuranceNextStepsPage.tsx": "Evangelism page rendering next-steps content with scripture references, navigation links, and CTA card.",
  "frontend/src/pages/ConnectPage.tsx": "Evangelism page explaining Christian community connection with sections, references, navigation links, and CTA card.",
  "frontend/src/pages/DailyFeedPage.tsx": "Renders the community feed with tabs for social and daily content, loading unified and legacy feed data and interleaving legacy items. Handles loading, errors, authentication, and displays post composer and feed cards.",
  "frontend/src/pages/DiscernmentDetailPage.tsx": "Displays details for a single discernment reflection fetched from the daily feed using its index. Handles loading, missing items, and shows content, references, and labels.",
  "frontend/src/pages/evangelismContent.ts": "Defines structured evangelism content objects for multiple pages, including headings, text, references, and connection notes.",
  "frontend/src/pages/HowToBeginPage.tsx": "Shows evangelism guidance steps for beginning faith in Jesus, using content definitions to render steps, scripture references, a sample prayer, and navigation links.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects user profile info (name, life situation, spiritual needs) and saves it via a mutation before navigating to the feed. Includes validation, loading states, and a form UI.",
  "frontend/src/pages/PeaceWithGodPage.tsx": "Displays gospel-oriented teaching content with sections, scripture references, and navigation, using predefined evangelism content. Includes a concluding CTA and links to related pages.",
  "frontend/src/pages/ScriptureDetailPage.tsx": "Shows detailed view of a specific scripture entry from the daily feed, including the text, references, reflection, and labels. Handles loading and missing scripture states.",
  "frontend/src/pages/SubmitTestimonyPage.tsx": "Form page for submitting testimonies with optional scripture references and a post-submission confirmation screen.",
  "frontend/src/pages/WhyJesusPage.tsx": "Renders evangelism content about Jesus with sectioned cards, scripture references, navigation links, and a CTA.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, persisting, and clearing URL parameters and session-stored values.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and component styling with plugins enabled.",
  "project_state.json": "Project metadata describing app features, architecture, authentication, evangelism pages, and existing requirement mappings."
}