{
  "backend/main.mo": "Defines types and storage maps for user profiles, testimonies, scripture entries, reflections, feed items, comments, and agent responses, with access‑controlled query and update methods. Implements authorization checks for viewing and modifying user‑related data.",
  "feature_evidence.json": "Feature evidence report describing a UI update to AppHeader.tsx to use a new logo asset with adjusted sizing. Lists affected file, components, test IDs, and confidence level.",
  "frontend-file-summaries.txt": "JSON-style text mapping each frontend file to a short summary of its purpose, covering routing, layouts, components, pages, hooks, and styles.",
  "frontend/index.css": "Global Tailwind base layer defining color tokens, dark mode variables, and applying background and text styles across the app.",
  "frontend/index.html": "Base HTML document linking the favicon, setting metadata, and loading the React app entry point.",
  "frontend/src/App.tsx": "Main application router configuration wiring all evangelism, onboarding, feed, and detail routes, wrapped in AppLayout with query and theme providers.",
  "frontend/src/components/AuthGate.tsx": "Landing and authentication gate page with hero section, logo, CTA buttons, and login handling using Internet Identity.",
  "frontend/src/components/evangelism/EvangelismCtaCard.tsx": "CTA card prompting users to sign in, complete onboarding, or proceed to the feed based on authentication and profile state.",
  "frontend/src/components/evangelism/EvangelismPageShell.tsx": "Layout wrapper for evangelism pages with optional hero image, title block, and content area.",
  "frontend/src/components/feed/AddCommentForm.tsx": "Form for submitting comments or prayer requests with optional scripture references using addComment mutation.",
  "frontend/src/components/feed/AgentReplyCard.tsx": "Displays an AI agent’s reply with content, scripture references, and timestamp in a styled card.",
  "frontend/src/components/feed/AuthorIdentityBadge.tsx": "Renders an identity badge showing either the system agent or a user’s profile name.",
  "frontend/src/components/feed/CommentsThreadDialog.tsx": "Dialog showing a scrollable comment thread, including agent replies, plus a form to add new comments.",
  "frontend/src/components/feed/CreatePostComposer.tsx": "Composer card for creating a new feed post with optional scripture references using createPost mutation.",
  "frontend/src/components/feed/FeedItemCard.tsx": "Displays a feed item (scripture, discernment, or testimony) with type‑specific styling and navigation.",
  "frontend/src/components/feed/FollowButton.tsx": "Follow/unfollow button handling user interactions and updating follow state via mutations.",
  "frontend/src/components/feed/ReactionBar.tsx": "Reaction button allowing users to like/unlike a post and showing reaction count.",
  "frontend/src/components/feed/RepostButton.tsx": "Button to repost an item to the user’s feed using the repost mutation and showing count.",
  "frontend/src/components/feed/UnifiedFeedItemCard.tsx": "Renders a feed item card with icons, author info, metadata, content, and actions such as reactions, comments, reposts, and follow.",
  "frontend/src/components/layout/AppHeader.tsx": "Displays the main site header with logo navigation, evangelism CTA, and authenticated user actions including sharing and logout.",
  "frontend/src/components/layout/AppLayout.tsx": "Layout wrapper providing header, main content container, and footer styling for all pages.",
  "frontend/src/hooks/queryKeys.ts": "Defines centralized React Query cache keys for user profiles, feeds, reactions, follows, and comments.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to Internet Identity, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useEvangelismScrollToTop.ts": "Scrolls to the top automatically when navigating to evangelism-related routes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, stored identity loading, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks to fetch and mutate backend data including profiles, feeds, posts, reactions, and comments.",
  "frontend/src/index.css": "Tailwind base and custom theme variables defining a vintage color palette, typography, and utility classes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider and loads global styles.",
  "frontend/src/pages/AssuranceNextStepsPage.tsx": "Renders the Assurance & Next Steps evangelism page with sections, scripture references, navigation links, and a CTA card.",
  "frontend/src/pages/ConnectPage.tsx": "Displays the Connect evangelism page with community-related sections, scripture references, navigation links, and a CTA card.",
  "frontend/src/pages/DailyFeedPage.tsx": "Loads and displays unified and legacy daily feed content with tabs, error/loading states, post composer, and interleaving logic.",
  "frontend/src/pages/DiscernmentDetailPage.tsx": "Shows detailed content for a single discernment reflection with references, labels, and navigation back to the feed.",
  "frontend/src/pages/evangelism/topics-questions/TopicPageShell.tsx": "Layout component for topic/question pages that renders sections, references, a back link, framing content, and a CTA card.",
  "frontend/src/pages/evangelism/topics-questions/topics/HowToReadTheBiblePage.tsx": "Loads the 'how-to-read-the-bible' topic and renders it with TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/HowToShareYourFaithPage.tsx": "Loads the 'how-to-share-your-faith' topic and displays it via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatHappensAfterDeathPage.tsx": "Retrieves the 'what-happens-after-death' topic and renders it with TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsBaptismPage.tsx": "Displays the 'what-is-baptism' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsFaithPage.tsx": "Renders the 'what-is-faith' topic through TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsPrayerPage.tsx": "Loads the 'what-is-prayer' topic and passes it to TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsRepentancePage.tsx": "Displays the 'what-is-repentance' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsSalvationPage.tsx": "Renders the 'what-is-salvation' topic through TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsSinPage.tsx": "Shows the 'what-is-sin' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsTheChurchPage.tsx": "Loads and renders the 'what-is-the-church' topic via TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhatIsTheGospelPage.tsx": "Displays the 'what-is-the-gospel' topic using TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhoIsGodPage.tsx": "Renders the 'who-is-god' topic with TopicPageShell.",
  "frontend/src/pages/evangelism/topics-questions/topics/WhyDidJesusDiePage.tsx": "Loads the 'why-did-jesus-die' topic and renders it through TopicPageShell.",
  "frontend/src/pages/evangelismContent.ts": "Provides structured evangelism content for pages, including peaceWithGod and whyJesus sections with headings, text, references, and framing.",
  "frontend/src/pages/HowToBeginPage.tsx": "Renders the How to Begin evangelism page with numbered steps, scripture references, prayer guidance, navigation links, and a CTA card.",
  "frontend/src/pages/OnboardingPage.tsx": "Collects user profile data and saves it to personalize content before navigating to the feed.",
  "frontend/src/pages/PeaceWithGodPage.tsx": "Renders the Peace With God evangelism page with gospel content sections, Scripture references, and links to related topics.",
  "frontend/src/pages/peaceWithGodStepsContent.ts": "Defines Peace With God step content, including summaries, detailed text, and scripture references for each step.",
  "frontend/src/pages/PeaceWithGodStepsIntroPage.tsx": "Displays an introduction to the four-step Peace With God journey with step previews and a call-to-action to begin.",
  "frontend/src/pages/PeaceWithGodStepsLongPage.tsx": "Shows the full multi-step Peace With God guide with detailed explanations, Scriptures, response steps, and a sample prayer.",
  "frontend/src/pages/ScriptureDetailPage.tsx": "Fetches and displays a specific daily Scripture entry with its text, reflection, and labels, including navigation back to the feed.",
  "frontend/src/pages/SubmitTestimonyPage.tsx": "Provides a form for users to submit testimonies with validation and post-submit confirmation handling.",
  "frontend/src/pages/topicsQuestionsContent.ts": "Contains an array of topic/question content objects with slugs, descriptions, sections, references, and framing text.",
  "frontend/src/pages/TopicsQuestionsIndexPage.tsx": "Lists all topics and questions with links to detailed pages and a short description for each.",
  "frontend/src/pages/WhyJesusPage.tsx": "Renders the 'Why Jesus?' evangelism page using evangelismContent and displays sections, references, navigation links, and a CTA card.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL and hash parameters and persisting them in sessionStorage, plus utilities to clear stored or hash-based params.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, typography, animations, and plugin setup.",
  "project_state.json": "Tracks project state, feature requests, and metadata for adding and sizing the uploaded header logo."
}